// 2. Напишите программу, которая на вход принимает число и выдает его квадрат (число умноженное на само себя).

Console.Write("Введите число: ");
int x = Convert.ToInt32(Console.ReadLine());
int y = x*x;
Console.WriteLine(y);